# StartAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Revolution..::..StartAngle Property
Revolution Class See Also
---
The start angle of the revolution relative to the sketch plane.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double StartAngle { get; set; }
```

Visual Basic
---
```text
Public Property StartAngle As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double StartAngle {
	double get ();
	void set (double value);
}
```

# Remarks
The direction of the angle is based on the normal of the sketch plane. A positive angle is on the same side as the normal, a negative angle on the opposite side.
# See Also
Revolution Class
Autodesk.Revit.DB Namespace